In [100]:
import numpy as np
import pandas as pd

# Indexing and column rearrangement
There are circumstances in which it's useful to modify the order of your DataFrame columns. We do that now by extracting just two columns from the Pennsylvania election results DataFrame.

In this excersie we will read csv file and set the index to `country` and then assign a new DataFrame by selecting the list of columns `['winner', 'total', 'voters'].`

In [101]:
# Read in filename and set the index: election
election = pd.read_csv('pennsylvania2012_turnout.csv', index_col='county')

# Create a separate dataframe with the columns ['winner', 'total', 'voters']: results
results = election[['winner', 'total', 'voters']]

In [102]:
results.head()

           winner   total  voters
county
Adams      Romney   41973   61156
Allegheny   Obama  614671  924351
Armstrong  Romney   28322   42147
Beaver     Romney   80015  115157
Bedford    Romney   21444   32189

# Slicing rows
- Slice the row labels `'Perry'` to `'Potter'` and assign the output to `p_counties`.
- Print the p_counties DataFrame. This has been done for you.
- Slice the row labels `'Potter'` to `'Perry'` in reverse order. To do this for hypothetical row labels `'a'` and `'b'`, you could use a stepsize of `-1` like so: `df.loc['b':'a':-1]`.

In [103]:
# Slice the row labels 'Perry' to 'Potter': p_counties
p_counties = election.loc['Perry':'Potter']

In [104]:
p_counties

,state,total,Obama,Romney,winner,voters,turnout,margin
county,,,,,,,,
Perry,PA,18240,29.769737,68.591009,Romney,27245,66.948064,38.821272
Philadelphia,PA,653598,85.224251,14.051451,Obama,1099197,59.461407,71.172800
Pike,PA,23164,43.904334,54.882576,Romney,41840,55.363289,10.978242
Potter,PA,7205,26.259542,72.158223,Romney,10913,66.022175,45.898681

In [105]:
# Slice the row labels 'Potter' to 'Perry' in reverse order: p_counties_rev
p_counties_rev = election.loc['Potter':'Perry':-1]

In [106]:
p_counties_rev

,state,total,Obama,Romney,winner,voters,turnout,margin
county,,,,,,,,
Potter,PA,7205,26.259542,72.158223,Romney,10913,66.022175,45.898681
Pike,PA,23164,43.904334,54.882576,Romney,41840,55.363289,10.978242
Philadelphia,PA,653598,85.224251,14.051451,Obama,1099197,59.461407,71.172800
Perry,PA,18240,29.769737,68.591009,Romney,27245,66.948064,38.821272

# Slicing columns
- Slice the columns from the starting column to `'Obama'` and assign the result to left_columns
- Slice the columns from `'Obama'` to `'winner'` and assign the result to middle_columns
- Slice the columns from `'Romney'` to the end and assign the result to right_columns

In [107]:
# Slice the columns from the starting column to 'Obama': left_columns
left_columns = election.loc[:, :'Obama']

# Print the output of left_columns.head()
print(left_columns.head())

          state   total      Obama
county
Adams        PA   41973  35.482334
Allegheny    PA  614671  56.640219
Armstrong    PA   28322  30.696985
Beaver       PA   80015  46.032619
Bedford      PA   21444  22.057452

In [108]:

# Slice the columns from 'Obama' to 'winner': middle_columns
middle_columns = election.loc[:, 'Obama':'winner']

# Print the output of middle_columns.head()
print(middle_columns.head())

               Obama     Romney  winner
county
Adams      35.482334  63.112001  Romney
Allegheny  56.640219  42.185820   Obama
Armstrong  30.696985  67.901278  Romney
Beaver     46.032619  52.637630  Romney
Bedford    22.057452  76.986570  Romney

In [109]:
# Slice the columns from 'Romney' to the end: 'right_columns'
right_columns = election.loc[:, 'Romney':]

# Print the output of right_columns.head()
print(right_columns.head())

              Romney  winner  voters    turnout     margin
county
Adams      63.112001  Romney   61156  68.632677  27.629667
Allegheny  42.185820   Obama  924351  66.497575  14.454399
Armstrong  67.901278  Romney   42147  67.198140  37.204293
Beaver     52.637630  Romney  115157  69.483401   6.605012
Bedford    76.986570  Romney   32189  66.619031  54.929118

# Subselecting DataFrames with lists
Lists can be used to select specific row and column labels with the `.loc[]` accessor. In this exercise, your job is to select the counties `['Philadelphia', 'Centre', 'Fulton']` and the columns `['winner','Obama','Romney']` from the election DataFrame.

- Create the list of row labels `['Philadelphia', 'Centre', 'Fulton']` and assign it to rows.
- Create the list of column labels `['winner', 'Obama', 'Romney']` and assign it to cols.
- Create a new DataFrame by selecting with rows and cols in `.loc[]` and assign it to three_counties.
- Print the three_counties DataFrame.

In [110]:
# Create the list of row labels: rows
rows = ['Philadelphia', 'Centre', 'Fulton']

# Create the list of column labels: cols
cols = ['winner', 'Obama', 'Romney']

# Create the new DataFrame: three_counties
three_counties = election.loc[rows,cols]

In [111]:
# Print the three_counties DataFrame
three_counties

              winner      Obama     Romney
county
Philadelphia   Obama  85.224251  14.051451
Centre        Romney  48.948416  48.977486
Fulton        Romney  21.096291  77.748861

# Thresholding data
- Create a boolean array of the condition where the `'turnout'` column is greater than 70 and assign it to `high_turnout`.
- Filter the election DataFrame with the `high_turnout` array and assign it to `high_turnout_df`.

In [112]:
# Create the boolean array: high_turnout
high_turnout = election['turnout'] > 70

# Filter the election DataFrame with the high_turnout array: high_turnout_df
high_turnout_df = election[high_turnout]

In [113]:
# Print the high_turnout_results DataFrame
high_turnout_df

,state,total,Obama,Romney,winner,voters,turnout,margin
county,,,,,,,,
Bucks,PA,319407,49.966970,48.801686,Obama,435606,73.324748,1.165284
Butler,PA,88924,31.920516,66.816607,Romney,122762,72.436096,34.896091
Chester,PA,248295,49.228539,49.650617,Romney,337822,73.498766,0.422079
Forest,PA,2308,38.734835,59.835355,Romney,3232,71.410891,21.100520
Franklin,PA,62802,30.110506,68.583803,Romney,87406,71.850903,38.473297
Montgomery,PA,401787,56.637223,42.286834,Obama,551105,72.905708,14.350390
Westmoreland,PA,168709,37.567646,61.306154,Romney,238006,70.884347,23.738508

# Filtering columns using other columns
The election results DataFrame has a column labeled 'margin' which expresses the number of extra votes the winner received over the losing candidate. This number is given as a percentage of the total votes cast. It is reasonable to assume that in counties where this margin was less than 1%, the results would be too-close-to-call.

- Create a boolean array for the condition where the `'margin'` column is less than 1 and assign it to too_close.
- Convert the entries in the `'winner'` column where the result was too close to call to `np.nan`.
- Print the output of `election.info()`.

In [114]:
# Create the boolean array: too_close
too_close = election['margin'] < 1

# Assign np.nan to the 'winner' column where the results were too close to call
election.loc[too_close, 'winner'] = np.nan

In [115]:
# Print the output of election.info()
election.info()

<class 'pandas.core.frame.DataFrame'>
Index: 67 entries, Adams to York
Data columns (total 8 columns):
state      67 non-null object
total      67 non-null int64
Obama      67 non-null float64
Romney     67 non-null float64
winner     64 non-null object
voters     67 non-null int64
turnout    67 non-null float64
margin     67 non-null float64
dtypes: float64(4), int64(2), object(2)
memory usage: 7.2+ KB

# Using apply() to transform a column
The `.apply()` method can be used on a pandas DataFrame to apply an arbitrary Python function to every element. In this exercise you'll take daily weather data in Pittsburgh in 2013.

- Apply the to_celsius function over the `['Mean TemperatureF','Mean Dew PointF']` columns of the weather DataFrame.
- Reassign the columns of `df_celsius` to `['Mean TemperatureC','Mean Dew PointC']`.
- Print to see the new DataFrame with the converted units.

In [116]:
weather = pd.read_csv('underground_weather.csv')

In [117]:
# Write a function to convert degrees Fahrenheit to degrees Celsius: to_celsius
def to_celsius(F):
    return 5/9*(F - 32)

In [118]:
# Apply the function over 'Mean TemperatureF' and 'Mean Dew PointF': df_celsius
df_celsius = weather[['Mean TemperatureF','Mean Dew PointF']].apply(to_celsius)

In [119]:
# Reassign the columns df_celsius
df_celsius.columns = ['Mean TemperatureC', 'Mean Dew PointC']

In [120]:
df_celsius.head()

   Mean TemperatureC  Mean Dew PointC
0          -2.222222        -2.777778
1          -6.111111       -11.111111
2          -4.444444        -9.444444
3          -2.222222        -7.222222
4          -1.111111        -6.666667

# Using .map() with a dictionary
The `.map()` method is used to transform values according to a Python dictionary look-up. In this excercise we are going to use a dictionary to map the values `'Obama'` and `'Romney'` in the `'winner'` column to the values `'blue'` and `'red'`, and assign the output to the new column `'color'`.

In [121]:
# Create the dictionary: red_vs_blue
red_vs_blue = {'Obama':'blue', 'Romney':'red'}

# Use the dictionary to map the 'winner' column to the new column: election['color']
election['color'] = election['winner'].map(red_vs_blue)

In [122]:
election.head()

,state,total,Obama,Romney,winner,voters,turnout,margin,color
county,,,,,,,,,
Adams,PA,41973,35.482334,63.112001,Romney,61156,68.632677,27.629667,red
Allegheny,PA,614671,56.640219,42.185820,Obama,924351,66.497575,14.454399,blue
Armstrong,PA,28322,30.696985,67.901278,Romney,42147,67.198140,37.204293,red
Beaver,PA,80015,46.032619,52.637630,Romney,115157,69.483401,6.605012,red
Bedford,PA,21444,22.057452,76.986570,Romney,32189,66.619031,54.929118,red

# Index objects and labeled data
## pandas Data Structures
- Key building blocks
 - indexs: Sequence of lables
 - Series 1D array with index
 - DataFrames: 2D array with Seires as columns
- Indexes
 - Immutable (Like dictionary keys)
 - Homogenous in data type (Like Numpy arrays)

In [123]:
prices = [10.34, 10.36, 10.74, 10.71, 10.79]
shares = pd.Series(prices)

In [124]:
shares

0    10.34
1    10.36
2    10.74
3    10.71
4    10.79
dtype: float64

In [125]:
# Creating an index
days = ['Mon', 'Tue', 'Wed', 'Thur', 'Fri']
shares = pd.Series(prices, index=days)

In [126]:
shares

Mon     10.34
Tue     10.36
Wed     10.74
Thur    10.71
Fri     10.79
dtype: float64

In [127]:
shares.index

Index(['Mon', 'Tue', 'Wed', 'Thur', 'Fri'], dtype='object')

In [128]:
#Modifying index name
shares.index.name = 'weekday'

In [129]:
shares

weekday
Mon     10.34
Tue     10.36
Wed     10.74
Thur    10.71
Fri     10.79
dtype: float64

# Extracting data with a MultiIndex
Read the data sales.csv into dataframe sales and extract elements from the outermost level of a MultiIndex is just like in the case of a single-level Index.

- Print `sales.loc[['CA', 'TX']]`. Note how New York is excluded.
- Print `sales['CA':'TX']`. Note how New York is included.

In [130]:
sales = pd.read_csv('sales.csv', index_col='state')

In [131]:
sales.loc[['CA', 'TX']]

       month  eggs  salt  spam
state
CA         1    47  12.0    17
CA         2   110  50.0    31
TX         1   132   NaN    52
TX         2   205  60.0    55

In [132]:
sales['CA':'TX']

       month  eggs  salt  spam
state
CA         1    47  12.0    17
CA         2   110  50.0    31
NY         1   221  89.0    72
NY         2    77  87.0    20
TX         1   132   NaN    52
TX         2   205  60.0    55

# Setting & sorting a MultiIndex
- Create a MultiIndex by setting the index to be the columns `['state', 'month']`.
- Sort the MultiIndex using the `.sort_index()` method.
- Print the sales DataFrame.

In [133]:
sales = pd.read_csv('sales.csv')

In [134]:
sales = sales.set_index(['state', 'month'])

In [135]:
# Sort the MultiIndex: sales
sales = sales.sort_index()

In [136]:
sales

             eggs  salt  spam
state month
CA    1        47  12.0    17
      2       110  50.0    31
NY    1       221  89.0    72
      2        77  87.0    20
TX    1       132   NaN    52
      2       205  60.0    55

In [137]:
sales.loc[('NY', 1)]

eggs    221.0
salt     89.0
spam     72.0
Name: (NY, 1), dtype: float64

# Indexing multiple levels of a MultiIndex
- Look up data for the New York column `('NY')` in month 1.
- Look up data for the California and Texas columns `('CA', 'TX')` in month 2.
- Look up data for all states in month 2. Use `(slice(None), 2)` to extract all rows in month 2.

In [138]:
# Look up data for NY in month 1: NY_month1
NY_month1 = sales.loc[('NY', 1)]
NY_month1

eggs    221.0
salt     89.0
spam     72.0
Name: (NY, 1), dtype: float64

In [139]:
# Look up data for CA and TX in month 2: CA_TX_month2
CA_TX_month2 = sales.loc[(['CA','TX'],2), :]
CA_TX_month2

             eggs  salt  spam
state month
CA    2       110  50.0    31
TX    2       205  60.0    55

In [140]:
# Look up data for all states in month 2: all_month2
all_month2 = sales.loc[(slice(None), 2), :]
all_month2

             eggs  salt  spam
state month
CA    2       110  50.0    31
NY    2        77  87.0    20
TX    2       205  60.0    55

# Pivoting DataFrames
## Pivoting a single variable

Suppose you started a blog for a band, and you would like to log how many visitors you have had, and how many signed-up for your newsletter. To help design the tours later, you track where the visitors are. We're going to use users.csv for this. Import `user.csv` into DataFrame users.

- Pivot the users DataFrame with the rows indexed by `'weekday'`, the columns indexed by 'city', and the values populated with `'visitors'`.
- Print the pivoted DataFrame.

In [143]:
users = pd.read_csv('users.csv')

In [144]:
users.head()

  weekday    city  visitors  signups
0     Sun  Austin       139        7
1     Sun  Dallas       237       12
2     Mon  Austin       326        3
3     Mon  Dallas       456        5

In [145]:
# Pivot the users DataFrame: visitors_pivot
visitors_pivot = users.pivot(index='weekday',columns='city', values='visitors')

In [146]:
visitors_pivot

city     Austin  Dallas
weekday
Mon         326     456
Sun         139     237

# Pivoting all variables
If you do not select any particular variables, all of them will be pivoted. In this case - with the users DataFrame - both `'visitors'` and `'signups'` will be pivoted, creating hierarchical column labels.

- Pivot the users DataFrame with the `'signups'` indexed by `'weekday'` in the rows and `'city'` in the columns.
- Print the new DataFrame. This has been done for you.
- Pivot the users DataFrame with both '`signups'` and `'visitors'` pivoted - that is, all the variables. This will happen automatically if you do not specify an argument for the values parameter of `.pivot()`.
- Print the pivoted DataFrame.

In [70]:
# Pivot users with signups indexed by weekday and city: signups_pivot
signups_pivot = users.pivot(index='weekday', columns='city', values='signups')

In [147]:
signups_pivot

city     Austin  Dallas
weekday
Mon           3       5
Sun           7      12

In [148]:
# Pivot users pivoted by both signups and visitors: pivot
pivot = users.pivot(index='weekday', columns='city')

In [149]:
pivot

        visitors        signups
city      Austin Dallas  Austin Dallas
weekday
Mon          326    456       3      5
Sun          139    237       7     12

# Going from wide to long
You can move multiple columns into a single column (making the data long and skinny) by "melting" multiple columns. In this exercise, you will practice doing this.

- Define a DataFrame `skinny` where you melt the `'visitors'` and `'signups'` columns of users into a single column.
- Print `skinny` to verify the results. Note the value column that had the cell values in users.

In [150]:
# Melt users: skinny
skinny = pd.melt(users, id_vars=['weekday', 'city'])

# Print skinny
print(skinny)

  weekday    city  variable  value
0     Sun  Austin  visitors    139
1     Sun  Dallas  visitors    237
2     Mon  Austin  visitors    326
3     Mon  Dallas  visitors    456
4     Sun  Austin   signups      7
5     Sun  Dallas   signups     12
6     Mon  Austin   signups      3
7     Mon  Dallas   signups      5

# Obtaining key-value pairs with melt()
Sometimes, all you need is some key-value pairs, and the context does not matter. If said context is in the index, you can easily obtain what you want. For example, in the users DataFrame, the visitors and signups columns lend themselves well to being represented as key-value pairs. So if you created a hierarchical index with `'city'` and `'weekday'` columns as the index, you can easily extract key-value pairs for the `'visitors'` and `'signups'` columns by melting users and specifying `col_level=0`.

- Set the index of users to `['city', 'weekday']`.
- Print the DataFrame users_idx to see the new index.
- Obtain the key-value pairs corresponding to visitors and signups by melting `users_idx` with the keyword argument `col_level=0`.

In [151]:
# Set the new index: users_idx
users_idx = users.set_index(['city', 'weekday'])
users_idx

                visitors  signups
city   weekday
Austin Sun           139        7
Dallas Sun           237       12
Austin Mon           326        3
Dallas Mon           456        5

In [153]:
# Obtain the key-value pairs: kv_pairs
kv_pairs = pd.melt(users_idx, col_level=0)
kv_pairs

   variable  value
0  visitors    139
1  visitors    237
2  visitors    326
3  visitors    456
4   signups      7
5   signups     12
6   signups      3
7   signups      5

# Setting up a pivot table
A pivot table allows you to see all of your variables as a function of two other variables. In this exercise, you will use the .pivot_table() method to see how the users DataFrame entries appear when presented as functions of the 'weekday' and 'city' columns. That is, with the rows indexed by 'weekday' and the columns indexed by 'city'.

- Use a pivot table to index the rows of users by `'weekday'` and the columns of users by `'city'`. These correspond to the index and columns parameters of `.pivot_table()`.
- Print `by_city_day`

In [154]:
# Create the DataFrame with the appropriate pivot table: by_city_day
by_city_day = users.pivot_table(index='weekday', columns='city')

In [155]:
by_city_day

        signups        visitors
city     Austin Dallas   Austin Dallas
weekday
Mon           3      5      326    456
Sun           7     12      139    237

# Using other aggregations in pivot tables
You can also use aggregation functions with in a pivot table by specifying the aggfunc parameter. In this exercise, you will practice using the `'count'` and len aggregation functions - which produce the same result - on the users DataFrame.

- Define a DataFrame count_by_weekday1 that shows the count of each column with the parameter `aggfunc='count'`. The index here is `'weekday'`.
- Print count_by_weekday1.
- Replace `aggfunc='count'` with `aggfunc=len` and verify you obtain the same result.

In [156]:
# Use a pivot table to display the count of each column: count_by_weekday1
count_by_weekday1 = users.pivot_table(index='weekday', aggfunc='count')

In [157]:
count_by_weekday1

         city  signups  visitors
weekday
Mon         2        2         2
Sun         2        2         2

In [158]:
# Replace 'aggfunc='count'' with 'aggfunc=len': count_by_weekday2
count_by_weekday2 = users.pivot_table(index='weekday', aggfunc=len)

In [159]:
count_by_weekday1.equals(count_by_weekday2)

True

# Using margins in pivot tables
Sometimes it's useful to add totals in the margins of a pivot table. You can do this with the argument margins=True. In this exercise, you will practice using margins in a pivot table along with a new aggregation function: sum.

In [160]:
# Create the DataFrame with the appropriate pivot table: signups_and_visitors
signups_and_visitors = users.pivot_table(index='weekday', aggfunc=sum)
signups_and_visitors

         signups  visitors
weekday
Mon            8       782
Sun           19       376

In [161]:
# Add in the margins: signups_and_visitors_total 
signups_and_visitors_total = users.pivot_table(index='weekday', aggfunc=sum, margins=True)
signups_and_visitors_total

         signups  visitors
weekday
Mon            8       782
Sun           19       376
All           27      1158

# Grouping by multiple columns
We are going to use `groupby()` to analyze the titanic data set.
The `'pclass'` column identifies which class of ticket was purchased by the passenger and the `'embarked'` column indicates at which of the three ports the passenger boarded the Titanic. `'S'` stands for Southampton, England, `'C'` for Cherbourg, France and `'Q'` for Queenstown, Ireland. The task is to first group by the `'pclass'` column and count the number of rows in each class using the `'survived'` column. You will then group by the `'embarked'` and `'pclass'` columns and count the number of passengers.

- Group by the `'pclass'` column and save the result as by_class.
- Aggregate the `'survived'` column of `by_class` using `.count()`. Save the result as `count_by_class`.
- Print `count_by_class`. This has been done for you.
- Group titanic by the `'embarked'` and `'pclass'` columns. Save the result as `by_mult`.
- Aggregate the `'survived'` column of `by_mult` using `.count()`. Save the result as count_mult.
- Print `count_mult`